source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/CampinasSP.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<CancelarNfse versao="1.00">
			<Descricao>Cancelar nota fiscal de serviço</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://issdigital.campinas.sp.gov.br/WsNFe2/LoteRps.jws</WebEnderecoProducao>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://proces.wsnfe2.dsfnet.com.br"><soapenv:Header/><soapenv:Body><proc:cancelar soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><mensagemXml xsi:type="xsd:string">{xmlBodyScapeEnvio}</mensagemXml></proc:cancelar></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns1:cancelarResponse</WebTagRetorno>
			<WebEncodingRetorno>iso-8859-1</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<TargetNS></TargetNS>
		</CancelarNfse>
		<ConsultarLoteRps versao="1.00">
			<Descricao>Consulta lote RPS</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://issdigital.campinas.sp.gov.br/WsNFe2/LoteRps.jws</WebEnderecoProducao>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://proces.wsnfe2.dsfnet.com.br"><soapenv:Header/><soapenv:Body><proc:consultarLote soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><mensagemXml xsi:type="xsd:string">{xmlBodyScape}</mensagemXml></proc:consultarLote></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns1:consultarLoteResponse</WebTagRetorno>
			<WebEncodingRetorno>iso-8859-1</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<TargetNS></TargetNS>
		</ConsultarLoteRps>
		<ConsultarNfsePorRps versao="1.00">
			<Descricao>Consulta NFSe por RPS</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://issdigital.campinas.sp.gov.br/WsNFe2/LoteRps.jws</WebEnderecoProducao>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://proces.wsnfe2.dsfnet.com.br"><soapenv:Header/><soapenv:Body><proc:consultarNFSeRps soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><mensagemXml xsi:type="xsd:string">{xmlBodyScapeEnvio}</mensagemXml></proc:consultarNFSeRps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns1:consultarNFSeRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>iso-8859-1</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<TargetNS></TargetNS>
		</ConsultarNfsePorRps>
		<ConsultarNotaValida versao="1.00">
			<Descricao></Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://issdigital.campinas.sp.gov.br/WsNFe2/LoteRps.jws</WebEnderecoProducao>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://proces.wsnfe2.dsfnet.com.br"><soapenv:Header/><soapenv:Body><proc:consultarNota soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><mensagemXml xsi:type="xsd:string">{xmlBodyScapeEnvio}</mensagemXml></proc:consultarNota></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns1:consultarNotaResponse</WebTagRetorno>
			<WebEncodingRetorno>iso-8859-1</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<TargetNS></TargetNS>
		</ConsultarNotaValida>
		<ConsultarSequenciaLoteNotaRPS versao="1.00">
			<Descricao>Consulta Sequencia Lote Nota RPS</Descricao>
			<WebEnderecoHomologacao></WebEnderecoHomologacao>
			<WebEnderecoProducao>https://issdigital.campinas.sp.gov.br/WsNFe2/LoteRps.jws</WebEnderecoProducao>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://proces.wsnfe2.dsfnet.com.br"><soapenv:Header/><soapenv:Body><proc:consultarSequencialRps soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><mensagemXml xsi:type="xsd:string">{xmlBodyScape}</mensagemXml></proc:consultarSequencialRps></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns1:consultarSequencialRpsResponse</WebTagRetorno>
			<WebEncodingRetorno>iso-8859-1</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<TargetNS></TargetNS>
		</ConsultarSequenciaLoteNotaRPS>
		<RecepcionarLoteRpsSincrono versao="1.00">
			<Descricao>Recepcionar Lote RPS Sincrono</Descricao>
			<WebEnderecoProducao>https://issdigital.campinas.sp.gov.br/WsNFe2/LoteRps.jws</WebEnderecoProducao>
			<TagAssinatura></TagAssinatura>
			<TagAtributoID></TagAtributoID>
			<TagLoteAssinatura></TagLoteAssinatura>
			<TagLoteAtributoID></TagLoteAtributoID>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://proces.wsnfe2.dsfnet.com.br"><soapenv:Header/><soapenv:Body><proc:enviarSincrono soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><mensagemXml xsi:type="xsd:string">{xmlBodyScapeEnvio}</mensagemXml></proc:enviarSincrono></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<WebTagRetorno>ns1:enviarSincronoResponse</WebTagRetorno>
			<EncriptaTagAssinatura>true</EncriptaTagAssinatura>
			<WebEncodingRetorno>iso-8859-1</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<TargetNS></TargetNS>
		</RecepcionarLoteRpsSincrono>
	</Servicos>
</Configuracoes>